// +----------------------------------------------------------------------
// | B5GoCMF V1.0 [快捷通用基础管理开发平台]
// +----------------------------------------------------------------------
// | Author: 冰舞 <357145480@qq.com>
// +----------------------------------------------------------------------

package config

type RouteConf struct {
	Admin     string `yaml:"admin"`      //后台路由访问前缀 最后不能带有/
	Api       string `yaml:"api"`        //接口访问前缀 最后不能带有/
	AutoAdmin bool   `yaml:"auto-admin"` //当访问后端路由前缀是否自动跳转到后台
}
